public class Zadanie1 {
    public static void main(String[] args) {
        int x = 10;
        int y = 12;
        int z = 3;

        x += y - x++ * z;       // результат даної операції становить  -8
       // z = --x – y * 5;       // синтаксична помилка результат операціїї не виведеться в консоль
        y /= x + 5 % z;       // результат даної операції становить   1
        z = x++ + y * 5;     // результат даної операції становить   70
        x = y - x++ * z;    // результат даної операції становить   -18

        System.out.println("вивід в консоль розрахунку 1ї з 5ти операцій:");
          System.out.println();
    }
}
